cxf-consultar-imagen-rad/src/main/resources/wsdl/ConsultarImagenRadService.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.4-b01-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.4-b01-. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.servisoft.com.co/Mercurio/Servicios/Contract/ConsultarImagenRadicado" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.servisoft.com.co/Mercurio/Servicios/Contract/ConsultarImagenRadicado" name="ConsultarImagenRadService">
	<types>
		<xsd:schema>
			<xsd:import namespace="http://www.servisoft.com.co/Mercurio/Servicios/Schema/Transaccion" schemaLocation="Transaccion.xsd"></xsd:import>
		</xsd:schema>
		<xsd:schema>
			<xsd:import namespace="http://www.servisoft.com.co/Mercurio/Servicios/Schema/ImagenRadicado" schemaLocation="ImagenRadicado.xsd"></xsd:import>
		</xsd:schema>
	</types>
	<message name="consultarImagenRadicado">
		<part xmlns:ns1="http://www.servisoft.com.co/Mercurio/Servicios/Schema/ImagenRadicado" name="body" element="ns1:ImagenRadicadoRequest"></part>
	</message>
	<message name="consultarImagenRadicadoResponse">
		<part xmlns:ns2="http://www.servisoft.com.co/Mercurio/Servicios/Schema/ImagenRadicado" name="body" element="ns2:ImagenRadicadoResponse"></part>
	</message>
	<portType name="consultarImagenRadicadoInterface">
		<operation name="consultarImagenRadicado">
			<input message="tns:consultarImagenRadicado"></input>
			<output message="tns:consultarImagenRadicadoResponse"></output>
		</operation>
	</portType>
	<binding name="ConsultarImagenRadicadoSOAPBinding" type="tns:consultarImagenRadicadoInterface">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
		<operation name="consultarImagenRadicado">
			<soap:operation soapAction="http://www.servisoft.com.co/Servicio/Contract/ConsultarImagenRadicado/consultarImagenRadicado"></soap:operation>
			<input>
				<soap:body use="literal"></soap:body>
			</input>
			<output>
				<soap:body use="literal"></soap:body>
			</output>
		</operation>
	</binding>
	<service name="ConsultarImagenRadService">
		<port name="ConsultarImagenRadicadoSOAP" binding="tns:ConsultarImagenRadicadoSOAPBinding">
			<soap:address location="https://pruebasconti.jep.gov.co:443/mercurio/ConsultarImagenRadService"></soap:address>
		</port>
	</service>
</definitions>